text = ['На краю дороги стоял дуб. Вероятно в десять раз старше берез, составлявших лес, он был в десять раз толще и',
        'в два раза выше каждой березы. Это был огромный в два обхвата дуб с обломанными, давно видно, суками и с',
        'обломанной корой, заросшей старыми болячками. С огромными своими неуклюжими,',
        'несимметрично-растопыренными,',
        'корявыми руками и пальцами, он старым, сердитым и презрительным уродом стоял между',
        'улыбающимися березами. Только он один не хотел подчиняться обаянию весны',
        'и не хотел видеть ни весны, ни солнца. 4+++3-- 3 -3+4- 3+-6 -+ 8-6',
        '-1+1 a -1-2 a 1--1 a 1---1 a 1 -+ 1',
        '1 +- 1 a 1 - 1 +++ 1 - 1']
